<template>
    <div class="page-wrapper" style="height: 100%">
        <!-- ============================================================== -->
        <!-- Container fluid  -->
        <!-- ============================================================== -->
        <div class="container-fluid">
            <!-- ============================================================== -->
            <!-- Bread crumb and right sidebar toggle -->
            <!-- ============================================================== -->
            <div class="row page-titles">
                <div class="col-md-5 align-self-center">
                    <h3 class="text-themecolor">Здесь мы когда-нибудь запилим статистику</h3>
                </div>
            </div>
            <!-- ============================================================== -->
            <!-- End Bread crumb and right sidebar toggle -->
            <!-- ============================================================== -->
            <!-- ============================================================== -->
            <!-- Start Page Content -->
            <!-- ============================================================== -->
            <transition  name="fade">
            <div class="row" v-if="loading">
                <div class="col-4">
                    <div class="card">
                        <div class="card-header text-center">
                            А пока, аффирмации для стримеров =)
                        </div>
                        <div class="card-body text-center">
                           <h3>{{jokes[i]}}</h3>
                        </div>
                        <button class="btn btn-info text-center" @click.prevent="rand">
                            <i class="mdi mdi-refresh fa-2x margin-bottom"></i> Еще вжух!
                        </button>
                    </div>
                </div>
            </div>
            </transition>
            <!-- ============================================================== -->
            <!-- End PAge Content -->
            <!-- ============================================================== -->
        </div>
        <!-- ============================================================== -->
        <!-- End Container fluid  -->
        <!-- ============================================================== -->
        <!-- ============================================================== -->
        <!-- footer -->
        <!-- ============================================================== -->
        <footer class="footer">
            © 2019
        </footer>
        <!-- ============================================================== -->
        <!-- End footer -->
        <!-- ============================================================== -->
    </div>
    <!-- ============================================================== -->
    <!-- End Page wrapper  -->
    <!-- ============================================================== -->
</template>


<script>
    export default {
        data() {
            return {
                loading: false,
                i:0,
                jokes: [
                    'Стример привет!',
                    'Твой онлайн увеличился',
                    'Все топ-донатеры сейчас получили зарплату... Eeee!!',
                    'Твои шутки стали смешными =)',
                    'Вжух, и одним двачером стало меньше',
                    'Ростелеком больше не лагает',
                    'В центре Питера появилась 3-шка за 20к',
                    'Лолошка переписывает Бэху на твоё имя',
                    'Pornhubuser just subscribed on your Twitch-channel...',
                    'Визборн лишается девтсвенности',
                    'Токсичность всех чатов падает до нуля',
                    'Ну, а мы твои сабы стали любить тебя еще сильнее',
                    'Спасибо за стримы ;)'
                ],
            }
        },
        created() {
            setTimeout(() =>{
               this.loading = true;
            }, 300);
        },
        methods: {
            rand(){
                let max = this.jokes.length - 1;
                if (this.i == max) {
                    this.i = 0;
                }
                else {
                    this.i++;
                }
            }
        }
    }
</script>
